Repository: thomas-moulard/twg-bomberman
Catalog: po/*.po
Languages: fr

source: Invalid return type.
fr: Type de retour invalide.

source: Unexpected error.
fr: Erreur inattendue.

source: This game mode is not yet implemented.
fr: Ce mode de jeu n'est pas encore implémenté.

source: Failed to load the configuratin file.
fr: Echec du chargement du fichier de configuration.

source: Error while loading the configuration file. Root element:
fr: Echec lors du chargement du fichier de configuration. Racine:

source: Invalid version of the configuration file
fr: Version invalide du fichier de configuration.

source: The query
fr: La requête

source: has failed.
fr: a échoué

source: Can not write the default configuration file.
fr: Impossible d'écrire le fichier de configuration par défaut.

source: A default configuration file has been generated with success.
fr: Un fichier de configuration par défaut a été généré avec succès

source: Failed to initialize SDL joystick subsystem.
fr: Echec de l'initialisation du sous-système de SDL gérant les joysticks.

source: joysticks found.
fr: manettes de jeu trouvées.

source: joystick
fr: manette de jeu

source: Try to access to invalid joystick
fr: Tentative d'accès à une manette de jeu invalide.

source: Failed to open joystick.
fr: Echec lors de l'ouverture de la manette de jeu.

source: Invalid key value.
fr: Type de retour invalide.

source: Game options
fr: Options de la partie

source: Game mode
fr: Mode de jeu

source: Classic
fr: Classique

source: Survival
fr: Survie

source: Map
fr: Carte

source: Player type
fr: Type de joueur

source: Human
fr: Humain

source: AI
fr: IA

source: Can not read the map directory.
fr: Impossible de lire le répertoire des cartes.

source: Invalid player inserted.
fr: Joueur invalide inséré.

source: Go !
fr: C'est parti!

source: The following block has an invalid position
fr: Le block suivant possède une position invalide.

source: No handle function for this state.
fr: Aucune fonction pour gérer cet état.

source: No available valid animation.
fr: Animation invalide.

source: The following BombPowerUp has an invalid position
fr: La BombPowerUp suivante a une position invalide.

source: The following ClassicBomb has an invalid position
fr: La ClassicBomb suivante a une position invalide.

source: The following DevilPowerUp has an invalid position
fr: Le DevilPowerUp suivant a une position invalide.

source: The winner is
fr: Le gagnant est

source: No winner has been found.
fr: Aucun gagnant n'a été trouvé.

source: The following FirePowerUp has an invalid position
fr: Le FirePowerUp suivant a une position invalide.

source: The following FollowBomb has an invalid position
fr: La FollowBomb suivante a une position invalide.

source: Invalid movement.
fr: Mouvement invalide.

source: Error while loading the map.
fr: Error lors du chargement de la carte.

source: Unexpected player id.
fr: Index de joueur inattendu.

source: Invalid root in XML file. ``
fr: Racine invalide dans le fichier XML ``

source: Normal game
fr: Jeu classique

source: Battle game
fr: Bataille

source: Credits
fr: Remerciements

source: Quit
fr: Quitter

source: The following MineBomb has an invalid position
fr: La MineBomb suivante a une position invalide.

source: The following ShootPowerUp has an invalid position
fr: Le ShootPowerUp suivant a une position invalide.

source: The following speedpowerup has an invalid position
fr: Le SpeedPowerUp suivant a une position invalide.

source: The following throwpowerup has an invalid position
fr: Le ThrowBombPowerUp suivant a une position invalide.

source: Failed to initialize SDL.
fr: Echec de l'initialisation de SDL.

source: Failed to initialize SDL_ttf.
fr: Echec de l'initialisation de SDL_ttf.

source: Invalid resolution.
fr: Animation invalide.

source: Failed to load the font.
fr: Impossible de charger la police.

source: Blit failed.
fr: La copie de la surface a échoué.

source: Invalid index choice.
fr: Choix d'index invalide.

source: Invalid animation.
fr: Animation invalide.

source: notice
fr: remarque

source: warning
fr: avertissement

source: error
fr: erreur

source: BinReloc failed to initialize (error code
fr: Echec de l'initialisation de BinReloc (code d'erreur
